OpenNuvoton/M480BSP/SampleCode/StdDriver/HSUSBH_USBH_AudioClass/main.c
            uac_dev = usbh_uac_get_device_list();
            if (uac_dev == NULL)
                continue;

            if (uac_dev != NULL) {                /* should be newly connected UAC device        */
                usbh_uac_open(uac_dev);

                uac_control_example(uac_dev);

                usbh_uac_start_audio_out(uac_dev, audio_out_callback);

                usbh_uac_start_audio_in(uac_dev, audio_in_callback);
            }
        }

        if (uac_dev == NULL) {
            au_in_cnt = 0;
            au_out_cnt = 0;

            if (!kbhit()) {
                ch = getchar();
                usbh_memory_used();
            }

            continue;
        }

        if (!kbhit()) {
            ch = getchar();

            if ((ch == '+') && (vol_cur + vol_res <= vol_max)) {
                printf("+");
                val16 = vol_cur+vol_res;
                if (usbh_uac_vol_control(uac_dev, UAC_MICROPHONE, UAC_SET_CUR, UAC_CH_MASTER, &val16) == UAC_RET_OK) {
                    printf("    Microphone set volume 0x%x success.\n", val16);
                    vol_cur = val16;
                } else
                    printf("    Failed to set microphone volume 0x%x!\n", val16);
            } else if ((ch == '-') && (vol_cur - vol_res >= vol_min)) {
                printf("-");
                val16 = vol_cur-vol_res;
                if (usbh_uac_vol_control(uac_dev, UAC_MICROPHONE, UAC_SET_CUR, UAC_CH_MASTER, &val16) == UAC_RET_OK) {
                    printf("    Microphone set volume 0x%x success.\n", val16);
                    vol_cur = val16;
                } else
                    printf("    Failed to set microphone volume 0x%x!\n", val16);
            } else if ((ch == '0') && (vol_cur - vol_res >= vol_min)) {
                if (usbh_uac_vol_control(uac_dev, UAC_MICROPHONE, UAC_GET_CUR, UAC_CH_MASTER, &vol_cur) == UAC_RET_OK)
                    printf("    Microphone current volume is 0x%x.\n", vol_cur);
                else
                    printf("    Failed to get microphone current volume!\n");
            } else {
                printf("IN: %d, OUT: %d\n", au_in_cnt, au_out_cnt);
                usbh_memory_used();
            }

        }  /* end of kbhit() */
    }
}


/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/
